package com.xbk.core.global.exception.common;
import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 常见业务异常枚举
 */
@AllArgsConstructor
@Getter
public enum BizExceptionCommonCodeEnum implements BizExceptionInterface {

    /**
     * 未知错误
     */
    CODE_100(100, "未知错误"),

    /**
     * 预留
     */
    CODE_101(101, "%s"),

    /**
     * 时间戳过期
     */
    CODE_141(141, "时间戳过期"),

    /**
     * sign验证失败
     */
    CODE_142(142, "sign验证失败"),

    /**
     * 版本升级
     */
    CODE_143(143, "尊敬的用户您好，客户端APP已经进行安全升级，请升级到最新版本使用"),

    /**
     * 角色授权
     */
    CODE_144(144, "角色没有授权"),

    // 参数
    /**
     * 参数为空
     */
    CODE_ARGS_110(110, "必传参数%s为空"),

    /**
     * 缺少参数
     */
    CODE_ARGS_111(111, "缺少参数:%s"),

    /**
     * 参数对象为空
     */
    CODE_ARGS_112(112, "参数对象为空"),

    /**
     * 参数 {0} 为空
     */
    CODE_ARGS_113(113, "参数%s为空"),

    /**
     * 参数不合法
     */
    CODE_ARGS_114(114, "参数不合法:%s"),

    /**
     * 参数转换异常
     */
    CODE_ARGS_115(115, "参数转化异常:%s"),

    /**
     * 数据转换
     */
    CODE_ARGS_116(116, "数据转化异常:%s"),

    /**
     * 参数校验
     */
    CODE_ARGS_117(117, "参数校验失败"),

    // 基础错误码
    /**
     * 配置不合法
     */
    CODE_201(201, "配置不合法:%s"),

    /**
     * 缺少配置
     */
    CODE_202(202, "缺少配置:%s"),

    /**
     * 未查询到配置
     */
    CODE_203(203, "未查到如下信息:%s"),

    /**
     * 重复提交
     */
    CODE_204(204, "处理中,请勿重复提交"),

    /**
     * 对象克隆失败
     */
    CODE_205(205, "对象克隆失败"),

    /**
     * 暂不支持表情符
     */
    CODE_206(206, "暂不支持表情符"),

    /**
     * 分页最大限制
     */
    CODE_207(207, "分页大小最大为%s"),

    // api 异常
    /**
     * Api 异常
     */
    CODE_API_301(301, "API异常,:%s"),

    /**
     * 消息发送异常
     */
    CODE_API_302(302, "消息发送异常,:%s"),

    /**
     * 接口调用异常
     */
    CODE_API_303(303, "接口调用失败"),

    /**
     * 接口返回数据为空
     */
    CODE_API_304(304, "接口返回内容为空"),

    /**
     * 接口返回数据格式不合法
     */
    CODE_API_305(305, "接口返回数据转格式不合法,缺少:%s"),

    /**
     * 返回的结果无状态码或者状态码未成功
     */
    CODE_API_306(306, "返回的结果无状态码或者状态码未成功"),

    /**
     * API缺少配置
     */
    CODE_API_307(307, "API缺少配置:%s"),

    ;
    /**
     * 状态码
     */
    private Integer code;

    /**
     * 描述信息
     */
    private String message;


}
